[{ "title": "Coffee Cream", "source": "https://ricette.giallozafferano.it/Crema-al-caffe.html", "img": "", "tags": ["coffee","cream","sugar"], "category": "dessert", "ingredients": ["70g coffee (cold)", "40g sugar", "300g cream (cold)"], "preparation": "To prepare the coffee cream, first, make the coffee using a moka pot. Then sweeten it and mix well, ensuring no residue remains at the bottom of the jug. Let the coffee cool first at room temperature for a few minutes and then place it in the fridge for at least 2 hours. After 2 hours, pour the well-chilled fresh liquid cream into a bowl that is also well-chilled. Begin to whip it with an electric mixer, and as soon as it starts to thicken slightly, gradually pour in the cold coffee while keeping the mixer running. Continue whipping the mixture until it reaches a frothy consistency, being careful not to over-whip the cream; to avoid this, finish whipping using a hand whisk. Enjoy your coffee cream immediately or cover with plastic wrap and store it in the fridge, remembering to revive it with a whisk before serving!" }, { "title": "Pastry Cream", "source": "www.gustoblog.it", "img": "media/crema_pasticcera.jpg", "tags": ["sauce"], "category": "basic preparations", "ingredients": ["4 egg yolks", "500ml milk", "85g sugar", "40g starch", "vanilla"], "preparation": "Pastry cream is a staple of Italian cuisine, a versatile and delicious cream that can be used in many ways. Its primary function is filling sponge cake-based desserts, but it can also be used for cookies, tarts, and tartlets, or even for more elaborate treats such as Zuppa Inglese or Charlotte cake. It is also the base recipe for lemon and chocolate cream. It can be enjoyed by the spoonful as an alternative to hot chocolate or used to make fried cream—a simple yet irresistible sweet. Let’s go through the recipe. The first step is to heat the milk. Place it in a jug and warm it in the microwave, or use a saucepan. If necessary, strain the milk through a sieve. Take a bowl and add the egg yolks and sugar, whisking them by hand until you get a fluffy and frothy mixture. Gradually incorporate the sifted starch, mixing continuously with the whisk to blend it well. If the mixture becomes too thick, you can add 2–3 tablespoons of warm milk. Slowly add the milk while stirring constantly until you get a smooth, lump-free batter. Mix in the seeds of half a vanilla pod or a tablespoon of vanilla extract. Pour the milk into a saucepan and add the yolk, sugar, and starch mixture, stirring well with a whisk to dissolve it completely. This step is crucial because failing to mix properly will lead to lumps forming during cooking. Turn on the heat and set it to low, cooking the cream while stirring continuously, paying special attention to the bottom and sides of the pot. As soon as it starts to simmer, it's ready. At this point, the consistency depends on your needs: if you prefer a runny cream, turn off the heat; if you want it thicker, let it cook for a few more minutes. If you're using the pastry cream as a cake filling, let it cool completely. Transfer it to a bowl and cover it with plastic wrap, pressing it onto the surface to retain moisture and prevent a skin from forming. If you don’t like vanilla, you can substitute it with orange or lemon zest or a hint of cinnamon. You can also make it with plant-based milk instead of dairy." }, { "title": "Cantucci", "source": "", "img": "media/cantucci.jpg", "tags": ["cookies", "almond"], "category": "dessert", "ingredients": ["300g all-purpose flour", "160g sugar", "a knob of butter", "2 eggs", "130g almonds with skin", "1/2 tsp baking powder", "a pinch of salt", "1 egg yolk"], "preparation": "Today, we present the traditional recipe for **Cantucci**, classic Italian biscuits that are perfect to enjoy after a meal or as a delicious Christmas gift. Start by preparing the **almonds**: place them on a baking sheet lined with parchment paper and toast them for a few minutes in a preheated oven at 200°C. Then set them aside to cool. Meanwhile, proceed with the dough: in a bowl, mix the **eggs**, **sugar**, and a pinch of **salt**. Once you have a fairly frothy mixture, incorporate the softened **butter**, followed by the **flour** and **baking powder**. Mix well until you get a smooth dough. Finally, add the almonds. Divide the dough in half. Shape each portion into logs about 3-4 cm in diameter. Brush their surface with a beaten egg yolk, then bake them in the oven at 200°C for 20 minutes. Once baked, remove them from the oven and let them cool for a couple of minutes. Then, slice the logs into 1 cm thick pieces and return them to the oven to toast for another 15 minutes at 200°C. Enjoy them warm or cold!" }]
